Repository: Bibek9849/workhive
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ne

source: Home
ne: गृहपृष्ठ

source: Jobs
ne: रोजगार

source: About Us
ne: हाम्रोबारे

source: Contact Us
ne: सम्पर्क

source: Profile
ne: प्रोफाइल

source: Settings
ne: सेटिङ्स

source: Logout
ne: लगआउट

source: Login
ne: लगइन

source: Register
ne: दर्ता गर्नुहोस्

source: WORKHIVE
ne: वर्कहाइभ

source: Gongabu, Kathmandu
ne: गोंगबु, काठमाडौं

source: Social Media
ne: सामाजिक मिडिया

source: Copyright © 2025 • WorkHive
ne: सर्वाधिकार © २०२५ • वर्कहाइभ

source: You Will Grow, You Will Succeed. We Promise That
ne: तपाईं अघि बढ्नुहुनेछ, तपाईं सफल हुनुहुनेछ। हामी तपाईंलाई यो सुनिश्चित गर्छौं।

source: Call for inquiry
ne: जिज्ञासाको लागि कल गर्नुहोस्

source: Send us email
ne: हामीलाई इमेल पठाउनुहोस्

source: Opening hours
ne: खुल्ने समय

source: Mon - Fri: 10AM - 10PM
ne: सोम - शुक्रबार: बिहान १० देखि राति १० बजेसम्म

source: Office
ne: कार्यालय

source: Kathmandu
ne: काठमाडौं

source: Contact Info
ne: सम्पर्क विवरण

source: We’d love to hear from you! Please fill out the form below.
ne: हामी तपाईंको सन्देश सुन्न चाहन्छौं! कृपया तलको फारम भर्नुहोस्।

source: Email Address
ne: इमेल ठेगाना

source: Your Message...
ne: तपाईंको सन्देश...

source: Send Message
ne: सन्देश पठाउनुहोस्

source: Welcome to WorkHive – Your Career Starts Here
ne: WorkHive मा स्वागत छ – तपाईंको करियर यतैबाट सुरु हुन्छ

source: WorkHive is a job and internship platform made especially for students and fresh graduates. We understand that starting a career can be confusing, especially when most job websites are designed for experienced professionals. That's why we built WorkHive – a simple, clean, and easy-to-use platform that helps you take your first step into the professional world.
ne: WorkHive विद्यार्थीहरू र नयाँ स्नातकहरूका लागि विशेष रूपमा बनाइएको जागिर तथा इन्टर्नशिप प्लेटफर्म हो। हामी बुझ्छौं कि करियर सुरु गर्नु अलमलको विषय हुन सक्छ, विशेषतः जब अधिकांश जागिर वेबसाइटहरू अनुभवी व्यक्तिहरूका लागि डिजाइन गरिएका हुन्छन्। त्यसैले हामीले WorkHive बनायौं – सरल, सफा र प्रयोग गर्न सजिलो प्लेटफर्म जसले तपाईंलाई व्यवसायिक जीवनमा पहिलो कदम चाल्न सहयोग गर्छ।

source: How it works
ne: यसले कसरी काम गर्छ

source: Get started in just four simple steps. Our streamlined process makes it easy to find and apply for your dream job or internship.
ne: सिर्फ चार सरल चरणहरूमा सुरु गर्नुहोस्। हाम्रो सजिलो प्रक्रिया मार्फत तपाईं सजिलै आफ्नो सपना जागिर वा इन्टर्नशिप खोज्न र आवेदन दिन सक्नुहुन्छ।

source: Create Account
ne: खाता बनाउनुहोस्

source: Start by entering your details to join us. Stay connected and explore new opportunities tailored just for you.
ne: हामीसँग जोडिनको लागि तपाईंका विवरणहरू प्रविष्ट गरेर सुरु गर्नुहोस्। जडित रहनुहोस् र तपाईंका लागि बनाइएका नयाँ अवसरहरू अन्वेषण गर्नुहोस्।

source: Upload Resume
ne: रिजुमे अपलोड गर्नुहोस्

source: Upload your resume and let employers discover your potential. Showcase your skills and experience professionally.
ne: आफ्नो रिजुमे अपलोड गर्नुहोस् र रोजगारदाताहरूलाई तपाईंको क्षमता देखाउनुहोस्। आफ्नो सीप र अनुभवलाई पेशेवर तरिकाले देखाउनुहोस्।

source: Find Jobs
ne: जागिर खोज्नुहोस्

source: Browse through thousands of job opportunities and internships. Filter by location, industry, and requirements.
ne: हजारौं जागिर र इन्टर्नशिप अवसरहरू हेर्नुहोस्। स्थान, उद्योग र आवश्यकताअनुसार फिल्टर गर्नुहोस्।

source: Apply Job
ne: जागिरमा आवेदन गर्नुहोस्

source: Apply to jobs with just one click. Track your applications and get notifications about your application status.
ne: सिर्फ एक क्लिकमा जागिरमा आवेदन गर्नुहोस्। आफ्नो आवेदनहरूको स्थिति ट्र्याक गर्नुहोस् र सूचना प्राप्त गर्नुहोस्।

source: WorkHive is a job and internship platform made especially for students and fresh graduates. We understand that starting a career can be confusing, especially when most job websites are designed for experienced professionals. That's why we built WorkHive – a simple, clean, and easy-to-use platform that helps you take your first step into the professional world.
ne: WorkHive विद्यार्थीहरू र नयाँ स्नातकहरूका लागि विशेष रूपमा बनाइएको जागिर र इन्टर्नशिप प्लेटफर्म हो। क्यारियर सुरु गर्नु अलमलको कुरा हुन सक्छ भन्ने हामी बुझ्छौं, विशेष गरेर जब अधिकांश जागिर वेबसाइटहरू अनुभवी पेशेवरहरूका लागि बनाइएका हुन्छन्। त्यसैले हामीले WorkHive बनायौं — एउटा सरल, सफा र प्रयोग गर्न सजिलो प्लेटफर्म, जसले तपाईंलाई व्यावसायिक दुनियाँमा पहिलो पाइला चाल्न सहयोग गर्छ।

source: Get started in just four simple steps. Our streamlined process makes it easy to find and apply for your dream job or internship.
ne: सिर्फ चार सरल चरणहरूमा सुरु गर्नुहोस्। हाम्रो सजिलो प्रक्रिया तपाईंलाई आफ्नो सपनाको जागिर वा इन्टर्नशिप सजिलै फेला पार्न र आवेदन दिन सहयोग गर्छ।

source: WorkHive - Profile
ne: वर्कहाइव - प्रोफाइल

source: Edit Profile
ne: प्रोफाइल सम्पादन गर्नुहोस्

source: Update your personal information
ne: आफ्नो व्यक्तिगत जानकारी अद्यावधिक गर्नुहोस्

source: First Name
ne: पहिलो नाम

source: Last Name
ne: थर

source: Date of Birth
ne: जन्म मिति

source: Experience
ne: अनुभव

source: Fresher
ne: नयाँ

source: 1-3 years
ne: १-३ वर्ष

source: 3-5 years
ne: ३-५ वर्ष

source: 5+ years
ne: ५+ वर्ष

source: Gender
ne: लिंग

source: Male
ne: पुरुष

source: Female
ne: महिला

source: Other
ne: अन्य

source: Education
ne: शिक्षा

source: SEE
ne: एसईई

source: Bachelor's
ne: स्नातक

source: Master's
ne: स्नातकोत्तर

source: Phone
ne: फोन

source: Skills
ne: कौशलहरू

source: Python
ne: पाइथन

source: Java
ne: जाभा

source: Flutter
ne: फ्लटर

source: JavaScript
ne: जाभास्क्रिप्ट

source: Save Changes
ne: परिवर्तनहरू सुरक्षित गर्नुहोस्

source: Cancel
ne: रद्द गर्नुहोस्

source: Applied Jobs
ne: आवेदन गरेका जागिरहरू

source: Change Password
ne: पासवर्ड परिवर्तन गर्नुहोस्

source: Keep your account secure with a strong password
ne: आफ्नो खाता बलियो पासवर्डको साथ सुरक्षित राख्नुहोस्

source: Enter your current password
ne: आफ्नो हालको पासवर्ड प्रविष्ट गर्नुहोस्

source: Password must contain:
ne: पासवर्डमा निम्न हुनुपर्छ:

source: At least 8 characters
ne: कम्तीमा ८ क्यारेक्टर

source: One uppercase letter
ne: एउटा ठूलो अक्षर

source: One lowercase letter
ne: एउटा सानो अक्षर

source: One number
ne: एउटा अंक

source: Password Strength
ne: पासवर्डको बल

source: Passwords match
ne: पासवर्ड मिल्यो

source: Passwords don't match
ne: पासवर्ड मिलेन

source: Update Password
ne: पासवर्ड अद्यावधिक गर्नुहोस्

source: Password Updated!
ne: पासवर्ड सफलतापूर्वक परिवर्तन भयो!

source: Updating...
ne: अद्यावधिक हुँदै...

source: Server error occurred.
ne: सर्भर त्रुटि भयो।

source: Security Tip
ne: सुरक्षा सुझाव

source: Choose a password that's unique to WorkHive and avoid using personal information. Consider using a password manager for better security.
ne: WorkHive मा अनौठो पासवर्ड प्रयोग गर्नुहोस् र व्यक्तिगत जानकारी प्रयोग नगर्नुहोस्। अझ सुरक्षितको लागि पासवर्ड म्यानेजर प्रयोग गर्नुहोस्।

source: Current Password
ne: हालको पासवर्ड

source: New Password
ne: नयाँ पासवर्ड

source: Enter your new password
ne: तपाईंको नयाँ पासवर्ड प्रविष्ट गर्नुहोस्

source: Confirm New Password
ne: नयाँ पासवर्ड पुष्टि गर्नुहोस्

source: Confirm your new password
ne: तपाईंको नयाँ पासवर्ड पुष्टि गर्नुहोस्

source: Weak
ne: कमजोर

source: Medium
ne: मध्यम

source: Strong
ne: मजबुत

source: No Applications Yet
ne: अहिलेसम्म कुनै आवेदन छैन

source: You haven't applied to any jobs yet. Start exploring opportunities!
ne: तपाईंले अहिलेसम्म कुनै जागिरमा आवेदन दिनुभएको छैन। अवसरहरू अन्वेषण गर्न सुरु गर्नुहोस्!

source: Find your
ne: आफ्नो

source: new job
ne: नयाँ जागिर

source: or
ne: वा

source: intern
ne: इन्टर्न

source: today
ne: खोज्नुहोस्

source: Recent Jobs Available
ne: हाल उपलब्ध नयाँ जागिरहरू

source: View all
ne: सबै हेर्नुहोस्

source: ago
ne: अघाडि

source: Job Details
ne: जागिर विवरण

source: No recent jobs found.
ne: भर्खरको कुनै जागिर फेला परेन।

source: Select Category
ne: वर्ग छान्नुहोस्

source: Search
ne: खोज्नुहोस्

source: Candidates
ne: उम्मेदवारहरू

source: Companies
ne: कम्पनीहरू

source: %(time)s ago
ne: %(time)s अघि

source: Job Description
ne: रोजगार विवरण

source: Key Responsibilities
ne: मुख्य जिम्मेवारीहरू

source: Professional Skills
ne: व्यावसायिक सीपहरू

source: Share Job:
ne: रोजगार साझेदारी गर्नुहोस्:

source: Related Jobs
ne: सम्बन्धित रोजगारीहरू

source: No related jobs found.
ne: सम्बन्धित रोजगारीहरू भेटिएनन्।

source: Job Overview
ne: रोजगार अवलोकन

source: Posted:
ne: पोस्ट गरिएको:

source: Job Type:
ne: रोजगार प्रकार:

source: Location:
ne: स्थान:

source: Salary:
ne: तलब:

source: Apply for Position
ne: पदमा आवेदन दिनुहोस्

source: Upload Resume/CV
ne: बायोडाटा/सीवी अपलोड गर्नुहोस्

source: Choose File
ne: फाइल छान्नुहोस्

source: No file chosen
ne: कोई फाइल चयन गरिएको छैन

source: Submit Application
ne: आवेदन पेश गर्नुहोस्

source: Job Listings
ne: रोजगार सूची

source: Search Filters
ne: खोज फिल्टरहरू

source: Clear
ne: हटाउनुहोस्

source: Job Title
ne: जागिरको शीर्षक

source: Salary Range
ne: तलब दायरा

source: Min (Rs)
ne: न्यूनतम (रु)

source: Max (Rs)
ne: अधिकतम (रु)

source: Popular ranges:
ne: लोकप्रिय दायराहरू:

source: Apply Filters
ne: फिल्टरहरू लागू गर्नुहोस्

source: WE ARE HIRING
ne: हामी कर्मचारी माग्दैछौं

source: Join our team today!
ne: आजै हाम्रो टिममा सामेल हुनुहोस्!

source: Apply Now
ne: अहिले आवेदन गर्नुहोस्

source: Sort by latest
ne: नवीनतम अनुसार क्रमबद्ध गर्नुहोस्

source: Showing %(shown)s of %(total)s results
ne: कुल %(total)s परिणामहरू मध्ये %(shown)s देखाउँदै

source: Default Logo
ne: पूर्वनिर्धारित लोगो

source: Search job title or company...
ne: जागिरको शीर्षक वा कम्पनी खोज्नुहोस्...

source: Location
ne: स्थान

source: Choose city
ne: शहर छान्नुहोस्

source: Job Type
ne: कामको प्रकार

source: Experience Level
ne: अनुभव स्तर

source: Date Posted
ne: पोस्ट गरिएको मिति

source: Category
ne: श्रेणी
